In [2]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine

In [3]:
df = pd.DataFrame( np.arange(20).reshape(4,5),
    columns=['white','red','blue','black','green'])
df

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [8]:
#==========================================
#sqlite3 db
#===========================================
engine = create_engine('sqlite:///mycolors.db')

In [9]:
df.to_sql('colors',engine)

In [10]:
pd.read_sql('colors',engine)

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19

In [11]:
# test the sqlite3 query
import sqlite3

In [12]:
qry = """
  CREATE TABLE mytable(
    Name VARCHAR(22),
    Age INTEGER,
    Gender VARCHAR(4),
    Salary REAL
  );
"""
qry

'\n  CREATE TABLE mytable(\n    Name VARCHAR(22),\n    Age INTEGER,\n    Gender VARCHAR(4),\n    Salary REAL\n  );\n'

In [13]:
sqlcon = sqlite3.connect(':memory:')
sqlcon.execute(qry)
sqlcon.commit()

In [16]:
data = [
    ('name1',23,'Male',102023),
    ('name2',28,'Female',1023),
    ('name3',31,'Male',102343),
    ('name4',53,'Male',102054453),
       ]
stmt = 'INSERT INTO mytable VALUES(?,?,?,?)'
sqlcon.executemany(stmt,data)
sqlcon.commit()

In [17]:
cursor = sqlcon.execute('select * from mytable')
rows = cursor.fetchall()
rows

[('name1', 23, 'Male', 102023.0),
 ('name2', 28, 'Female', 1023.0),
 ('name3', 31, 'Male', 102343.0),
 ('name4', 53, 'Male', 102054453.0)]

In [20]:
mydf = pd.DataFrame(rows)
mydf

       0   1       2            3
0  name1  23    Male     102023.0
1  name2  28  Female       1023.0
2  name3  31    Male     102343.0
3  name4  53    Male  102054453.0